# Groupby

In [4]:
import pandas as pd

In [ ]:
var = pd.DataFrame({ "name":["a","b","c","d" ,"a" , "b", "a", "b" , "a", "c","c"],
                      "s_1":[13,14,12,13,14,15,23,25,16,10,34], 
                      "s_2":[23,24,25,26,27,28,29,30,25,34,35] })

var

   name  s_1  s_2
0     a   13   23
1     b   14   24
2     c   12   25
3     d   13   26
4     a   14   27
5     b   15   28
6     a   23   29
7     b   25   30
8     a   16   25
9     c   10   34
10    c   34   35

In [6]:
var_new = var.groupby("name")

In [7]:
for x,y in var_new:
    print(x)
    print(y,"\n")

a
  name  s_1  s_2
0    a   13   23
4    a   14   27
6    a   23   29
8    a   16   25

b
  name  s_1  s_2
1    b   14   24
5    b   15   28
7    b   25   30

c
   name  s_1  s_2
2     c   12   25
9     c   10   34
10    c   34   35

d
  name  s_1  s_2
3    d   13   26

In [9]:
var_new.get_group("a")

  name  s_1  s_2
0    a   13   23
4    a   14   27
6    a   23   29
8    a   16   25

In [10]:
var_new.min()

      s_1  s_2
name
a      13   23
b      14   24
c      10   25
d      13   26

In [11]:
var_new.mean()

            s_1        s_2
name
a     16.500000  26.000000
b     18.000000  27.333333
c     18.666667  31.333333
d     13.000000  26.000000

In [13]:
li = list(var_new)
li

[('a',
    name  s_1  s_2
  0    a   13   23
  4    a   14   27
  6    a   23   29
  8    a   16   25),
 ('b',
    name  s_1  s_2
  1    b   14   24
  5    b   15   28
  7    b   25   30),
 ('c',
     name  s_1  s_2
  2     c   12   25
  9     c   10   34
  10    c   34   35),
 ('d',
    name  s_1  s_2
  3    d   13   26)]